
## Plan Result (dev/terraform)

[CI link](https://github.com/tooruuetani/gh-actions-test/actions/runs/8594229912)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "test-274-ecr-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":1,"Program":"tfcmt","SHA1":"957a1bad2247168b7f8a2d3cef79b198a94c5b67","Target":"dev/terraform","Vars":{},"WorkflowName":"common-check"} -->